export const question = {
  data: [
    {
      question: "Что из перечисленного является определением модели данных",
      answers: ["совокупность структур данных и операций их обработки"],
    },
    {
      question:
        "Жизненный цикл ИС регламентирует стандарт ISO/IEC 12207. IEC – это:",
      answers: ["международная комиссия по электротехнике"],
    },
    {
      question:
        "Наиболее распространённой моделью жизненного цикла согласно стандарту ISO/IEC 12207, является:",
      answers: ["каскадная модель"],
    },
    {
      question: "Выберите правильные типы NoSQL БД",
      answers: ["документоориентированные", "графовые"],
    },
    {
      question:
        "Комплекс программ для создания, ведения, использования БД - это...",
      answers: ["СУБД"],
    },
    {
      question: "К основным недостаткам NOSQL базам данных относится:",
      answers: ["небольшой функционал", "требования ACID не гарантированы"],
    },
    {
      question: "Что из перечисленного не является СУБД:",
      answers: ["MS Excel"],
    },
    {
      question: "К основным недостаткам реляционных БД можно отнести",
      answers: [
        "ограничение целостности данных",
        "ограниченность представления данных",
      ],
    },
    {
      question: "Что НЕ соответствует правилу ссылочного ограничения",
      answers: [
        "Значения первичного ключа в главной таблице не должны быть уникальны",
        "значения внешнего ключа не могут повторяться",
      ],
    },
    {
      question:
        "Какая модель ЖЦ предполагает быстрое получение версий разрабатываемого программного обеспечения",
      answers: ["Спиральная"],
    },
    {
      question: "Правило целостности объектов содержит следующие ограничения:",
      answers: [
        "обеспечивает уникальность каждой записи о реальном объекте реального мира",
        "поле первичного ключа не допускает null–значение",
      ],
    },
    {
      question: "По модели данных СУБД делят",
      answers: ["реляционные"],
    },
    {
      question:
        "Последовательность операций над БД, рассматриваемая СУБД как единое целое, называется:",
      answers: ["транзакцией"],
    },
    {
      question: "Какой стандарт регламентирует архитектуру СУБД",
      answers: ["ANSI"],
    },
    {
      question: "Выберите неправильные типы бинарных связей",
      answers: ["все-к-одному", "один-за-всех"],
    },
    {
      question: "Поддержка механизма транзакций реляционных СУБД является",
      answers: ["обязательной"],
    },
    {
      question:
        "Совокупность реальных объектов реального мира, информация о которых должна храниться в базе данных",
      answers: ["сущность"],
    },
    {
      question: "По способу доступа к данным СУБД делят",
      answers: ["клиент-серверные"],
    },
    {
      question: "К основным функциям, выполняемым СУБД, обычно относят:",
      answers: ["журнализация", "управление транзакциями"],
    },
    {
      question:
        "Какой вариант модели используется в документо-ориентированных базах данных",
      answers: ["объектно-ориентированная модель данных"],
    },
    {
      question:
        "Смысловое соответствие документа информационному запросу в том виде, в каком он сформулирован – это:",
      answers: ["релевантность"],
    },
    {
      question: "Под моделью ЖЦ ИС понимается:",
      answers: ["структура"],
    },
    {
      question: "В основе любой СУБД лежит",
      answers: ["модель данных"],
    },
    {
      question: "Концептуальная модель по некоторой предметной области – это",
      answers: ["описание сущностей, их свойств и взаимосвязей между ними"],
    },
    {
      question: "Информационные системы ориентированы на:",
      answers: ["конечного пользователя, не обладающего высокой квалификацией"],
    },
    {
      question:
        "??? – это часть мира, выделяемая как единое целое в течение некоторого отрезка времени:",
      answers: ["объект"],
    },
    {
      question: "Что не входит в требования ACID",
      answers: ["изоляция"],
    },
    {
      question: "Структура ИС представляет собой:",
      answers: ["набор обеспечивающих подсистем"],
    },
    {
      question: "Сущность по заданной предметной области - это:",
      answers: ["множество объектов"],
    },
    {
      question:
        "Наиболее точным аналогом реляционной базы данных может служить:",
      answers: ["двумерная таблица"],
    },
    {
      question: "Какой стадии в жизненном цикле ИС не существует?",
      answers: ["эволюция"],
    },
    {
      question: "Какой уровень в архитектуре СУБД лишний",
      answers: ["логичный", "физиологический"],
    },
    {
      question: "Выберите правильное определение БД",
      answers: [
        "большой объем данных, структурированный по определенным правилам",
      ],
    },
    {
      question: "Что из перечисленного является определением СУБД",
      answers: [
        "комплекс программных и языковых средств, необходимых для хранения данных",
      ],
    },
    {
      question:
        "Какая модель ЖЦ используется при каноническом проектировании ИС:",
      answers: ["каскадная"],
    },
    {
      question:
        "Смысловое соответствие документа информационным потребностям пользователя – это:",
      answers: ["пертинентность"],
    },
    {
      question:
        "Согласно стандарту ISO/IEC 12207, структура жизненного цикла ИС состоит из следующих процессов:",
      answers: [
        "основных и вспомогательных процессов жизненного цикла и организационных процессов",
      ],
    },
    {
      question: "Сущность иначе называют:",
      answers: [
        "частью реального мира, информация о котором подлежит хранению в БД",
      ],
    },
    {
      question: "Самый распространенный вид связи",
      answers: ["один-ко-многим"],
    },
    {
      question: "Целью концептуального анализа является",
      answers: [
        "описание сущностей предметной области, их свойств и связей между ними",
      ],
    },
    {
      question: "Ограничения целостности включает в себя",
      answers: ["ссылочную целостность", "целостность объектов"],
    },
    {
      question:
        "Какая модель ЖЦ делает упор на начальные этапы – анализ и проектирование",
      answers: ["Спиральная модель ЖЦ"],
    },
    {
      question:
        "Какой стадии в жизненном цикле ИС не существует? (варианты из исходника)",
      answers: ["верификация", "эволюция"],
    },
    {
      question:
        "Связь 'один-ко-многим' – это такой тип связи между сущностями А и В когда",
      answers: [
        "идентификация экземпляров уникальная только в направлении от В к А",
      ],
    },
    {
      question: "Внешний ключ сущности необходим",
      answers: ["для идентификации сущностей между собой(мб)"],
    },
    {
      question:
        "Модель данных в виде древовидной (иерархической) структуры - это",
      answers: ["иерархическая модель"],
    },
    {
      question:
        "Назовите самый верхний объект в объектной модели Microsoft Access",
      answers: ["Application"],
    },
    {
      question: "Для поиска записей по ключу в объекте Recordset используется",
      answers: ["метод Seek"],
    },
    {
      question:
        "На каком подэтапе проектирования БД создается логическая модель БД?",
      answers: ["концептуальное проектирование"],
    },
    {
      question: "Для чего служит объект TableDef",
      answers: ["для создания и изменения структуры таблиц"],
    },
    {
      question: "В каких СУБД НЕ поддерживаются требования ACID?",
      answers: ["NoSQL"],
    },
    {
      question:
        "Для того, чтобы получить доступ к объектам базы данных, надо установить активную ссылку на объект:",
      answers: ["Database"],
    },
    {
      question: "Метод Update объекта Recordset используется для:",
      answers: ["подтверждения изменений"],
    },
    {
      question: "Какая БД состоит из взаимосвязанного набора таблиц",
      answers: ["реляционная"],
    },
    {
      question: "Что НЕ входит в ограничение целостности?",
      answers: ["целостность связей"],
    },
    {
      question: "К основным свойствам БД можно отнести",
      answers: [
        "защиту данных от несанкционированного доступа",
        "поддержку целостности БД",
      ],
    },
    {
      question: "Для чего используются процедуры обработки событий?",
      answers: [
        "для управления программным кодом интерфейсов ввода-вывода информации",
        "обработки действий пользователя",
      ],
    },
    {
      question: "Выберите правильное определение жизненного цикла ИС",
      answers: [
        "период времени от замысла разработки БД до момента ее вывода из эксплуатации",
      ],
    },
    {
      question:
        "База данных называется полной и непротиворечивой, если в ней поддерживается:",
      answers: ["целостность"],
    },
    {
      question:
        "Какие семейства и объекты НЕ принадлежат объектной модели DAO 3.6",
      answers: ["Forms, form"],
    },
    {
      question:
        "Для поиска нескольких записей в объекте Recordset используются",
      answers: ["методы группы Find"],
    },
    {
      question: "Выберите правильное определение бизнес-процесса",
      answers: [
        "Бизнес-процесс – это совокупность различных действий, в рамках которой на входе используется один или более ресурсов, и в результате этой деятельности на выходе создается продукт, представляющий ценность для внешних и внутренних потребителей",
      ],
    },
    {
      question: "Процессный подход к управлению предприятием предполагает",
      answers: [
        "управление сквозными процессами",
        "обеспечение комплексного процесса достижения целей, стоящих перед организационной системой",
      ],
    },
    {
      question: "Модель TO-BE формируется на этапе",
      answers: ["прямого инжиниринга"],
    },
    {
      question: "Кто может являться владельцем бизнес- процесса",
      answers: [
        "Должностное лицо, имеющее в своем распоряжении выделенные ресурсы и отвечающее за ход выполнения",
      ],
    },
    {
      question: "Модель AS-IS формируется на этапе",
      answers: ["обратного инжиниринга"],
    },
    {
      question: "Внедрение процессного подхода означает создание:",
      answers: [
        "новой структуры организации",
        "новых типов управленческих решений",
      ],
    },
    {
      question:
        "Для чего нужно определять стратегию предприятия (выберите правильные ответы)",
      answers: ["Все верно"],
    },
    {
      question: "Выберите основные признаки цифровизации предприятий:",
      answers: ["переход на кастомизированые продукты и услуги"],
    },
    {
      question: "Выберите предприятия по инновационной форме деятельности:",
      answers: ['"Горизонтальное" предприятие', "Бережливое производство"],
    },
    {
      question: "Дискретное производство – это:",
      answers: [
        "выпускаемая продукция собирается из отдельных компонент, согласно конструкторским или производственным спецификациям конечного изделия.",
      ],
    },
    {
      question: "Реинжиниринг бизнеса - это:",
      answers: [
        "радикальное перепроектирование существующих бизнес-процессов.",
      ],
    },
    {
      question: "Что определяет точка зрения на контекстной диаграмме?",
      answers: ["границы моделирования системы и ее компонентов"],
    },
    {
      question: "В чем особенность национального проекта «Цифровая экономика»",
      answers: ["все верно"],
    },
    {
      question: "Какого подхода в реинжиниринге НЕ существует",
      answers: ["Авантюрный подход"],
    },
    {
      question: "Внешние информационные ресурсы предприятия — это",
      answers: [
        "Информация, поступающая от поставщиков",
        "Информация, поступающая от клиентов",
      ],
    },
    {
      question: "Какие интерфейсные дуги ОБЯЗАТЕЛЬНО должен иметь процесс",
      answers: ["входящая", "исходящая", "управления"],
    },
    {
      question: "Бизнес-потенциал компании – это:",
      answers: [
        "перечень основных, вспомогательных, обеспечивающих бизнес-функций и функций менеджмента",
      ],
    },
    {
      question:
        "К автоматизированным системам инженерных расчетов относятся следующие технологии:",
      answers: ["CAE (Computer Aided Engineering)"],
    },
    {
      question: "Жизненный цикл ИС – это:",
      answers: [
        "период времени от замысла разработки ИС до момента ее вывода из эксплуатации",
      ],
    },
    {
      question: "MRP (Material Requirements Planning) – это:",
      answers: ["системы планирования материальных потребностей"],
    },
    {
      question:
        "«Хозяйственная деятельность», в которой ключевым фактором производства являются данные в цифровом виде — это:",
      answers: ["цифровая экономика"],
    },
    {
      question:
        "Жизненный цикл ИС регламентирует стандарт ISO/IEC 12207. IEC — это:",
      answers: ["международная комиссия по электротехнике"],
    },
    {
      question: "Какой этап НЕ включает методология «6 Сигм»:",
      answers: ["поиск"],
    },
    {
      question: "Преобразованный ресурс — это:",
      answers: [
        "тот, к которому добавлена определённая ценность при выполнении процесса",
      ],
    },
    {
      question: "Наличие каких ИТ характеризует цифровое предприятие?",
      answers: ["сквозные технологии"],
    },
    {
      question:
        "Выберите основной признак, характеризующий краудсорсинговые модели:",
      answers: [
        "модели, базирующиеся на привлечении внешних ресурсов (денежных средств, людей, идей и др.) для реализации бизнес-процессов",
      ],
    },
    {
      question:
        "Выберите основной признак, характеризующий цифровые платформы:",
      answers: [
        "обеспечивающие прямое взаимодействие продавцов, покупателей и партнёров-поставщиков, минимизирующие транзакционные издержки и расширяющие возможности совместного потребления товаров и услуг",
      ],
    },
    {
      question: "Что определяет контекстная диаграмма?",
      answers: ["общее описание системы и её взаимодействие с внешней средой"],
    },
    {
      question: "Принцип «вертикального сжатия процесса» означает:",
      answers: ["o исполнители принимают самостоятельные решения"],
    },
    {
      question: "Моделью бизнес-процесса называется:",
      answers: [
        "формализованное (графическое, табличное, текстовое, символьное) описание, отражающее реально существующую или предполагаемую деятельность",
      ],
    },
    {
      question: "Что относится к сквозным технологиям:",
      answers: [
        "Нейротехнологии",
        "Системы распределенного реестра",
        "Большие данные",
      ],
    },
    {
      question: "Принцип «горизонтального сжатия процесса» означает:",
      answers: ["o несколько рабочих процедур объединяются в одну"],
    },
    {
      question:
        "Для чего нужна миссия предприятия (выберите правильные ответы)",
      answers: [
        "задаёт общие ориентиры направления функционирования предприятия",
        "определяет смысл его существования",
        "формирует облик компании в представлении окружающих",
      ],
    },
    {
      question:
        "Какие интерфейсные дуги обязательно должен иметь бизнес-процесс?",
      answers: ["входящая", "исходящая", "управления"],
    },
    {
      question: "К ключевым принципам «Индустрии 4.0» являются:",
      answers: ["Все верно"],
    },
    {
      question: "Собственные информационные ресурсы предприятия - это:",
      answers: ["Информация, генерируемая внутри предприятия"],
    },
    {
      question: "Когда состоялась 4 промышленная революция",
      answers: ["2011"],
    },
    {
      question:
        "К какой группе относят процессы, создающие добавленную стоимость продукту, который производит компания",
      answers: ["основные бизнес-процессы"],
    },
    {
      question: "Какие бизнес-процессы поддерживают инфраструктуру компании",
      answers: ["обеспечивающие бизнес-процессы"],
    },
    {
      question: "Функциональные диаграммы могут изображаться в нотации",
      answers: ["IDEF0"],
    },
    {
      question: "Что определяет контекстная диаграмма? (повтор в списке)",
      answers: ["общее описание системы и её взаимодействие с внешней средой"],
    },
    {
      question:
        "Совокупность операций, сгруппированных по определённому признаку — это:",
      answers: ["функция"],
    },
    {
      question:
        "Какие компоненты необходимо учесть при идентификации бизнес-процесса:",
      answers: [
        "владелец процесса",
        "поставщики процесса",
        "технология процесса",
        "ресурсы процесса",
        "клиенты процесса",
      ],
    },
    {
      question: "Укажите правильное определение ERP-системы:",
      answers: [
        "Интегрированная система для автоматизации планирования, учёта, контроля и анализа всех основных бизнес-операций предприятия",
      ],
    },
    {
      question: "Выберите правильные способы описания БП:",
      answers: ["Табличный", "Текстовый", "Графический"],
    },
    {
      question: "Реинжиниринг бизнеса — это: (повтор)",
      answers: ["радикальное перепроектирование существующих бизнес-процессов"],
    },
    {
      question:
        "У какого типа предприятий уровень задействования ресурсов > 100%?",
      answers: ["Активное производство"],
    },
    {
      question: "QRM (quick response manufacturing) — это концепция:",
      answers: ["Быстрореагирующего производства"],
    },
    {
      question:
        "Какая особенность при управлении организацией НЕ принадлежит функциональному подходу:",
      answers: ["Новые типы управленческих решений"],
    },
    {
      question: "Цикл Деминга-Шухарда описывает:",
      answers: ["управление бизнес-процессами"],
    },
    {
      question: "Инжиниринг — это:",
      answers: [
        "профессиональная предпринимательская деятельность по предоставлению услуг трансформации научных знаний и достижений в востребованную рынком интеллектуальную продукцию с добавленной потребительской ценностью",
      ],
    },
    {
      question:
        "Какую модель НЕ применяют при концептуальном моделировании ПО с помощью CASE-технологий?",
      answers: ["документальную"],
    },
    {
      question:
        "Информационными системами, поддерживающими производственный цикл, являются:",
      answers: ["MRPII"],
    },
    {
      question:
        "Разбиение одного отношения на два или более других, обладающих лучшими свойствами при вставке, изменении и удалении данных называется:",
      answers: ["нормализация"],
    },
    {
      question:
        "Какая инструкция языка SQL используется для объединения двух и более таблиц",
      answers: ["UNION"],
    },
    {
      question:
        "Какие семейства и объекты НЕ принадлежат объектной модели DAO 3.6: (повтор)",
      answers: ["Forms, Form"],
    },
    {
      question:
        "В каком случае необходимо применение предиката DISTINCTROW в языке SQL",
      answers: ["если записи полностью повторяются"],
    },
    {
      question:
        "Какая инструкция языка SQL используется для изменения записи/записей в таблице",
      answers: ["UPDATE"],
    },
    {
      question: "Кардинальное число отношения - это:",
      answers: ["множество кортежей"],
    },
    {
      question: "Концептуальная модель по некоторой предметной области - это",
      answers: ["описание сущностей, их свойств и взаимосвязей между ними"],
    },
    {
      question: "Выберите неправильную составную часть языка SQL",
      answers: ["DVL"],
    },
    {
      question:
        "Атрибут, по значению которого можно однозначно найти необходимый кортеж отношения – это (несколько ответов):",
      answers: ["первичный ключ", "альтернативный ключ"],
    },
    {
      question: "Укажите правильные свойства внешнего ключа",
      answers: [
        "внешний ключ не обязательно должен быть составным, если составным является первичный ключ целевого отношения",
        "Каждый атрибут внешнего ключа обязательно должен быть определен на том же домене, что и первичный ключ целевого отношения.",
      ],
    },
    {
      question:
        "В каких предложениях языка SQL допустимо использовать агрегатные функции",
      answers: ["HAVING", "SELECT", "GROUP BY"],
    },
    {
      question:
        "Правило целостности объектов содержит следующие ограничения (несколько):",
      answers: [
        "кортеж базового отношения - реальная сущность реального мира",
        "элемент первичного ключа не допускает null-значение",
      ],
    },
    {
      question: "Множество допустимых значений определенного атрибута, это",
      answers: ["домен"],
    },
    {
      question: "Какая инструкция языка SQL используется для создания таблицы",
      answers: ["SELECT INTO"],
    },
    {
      question: "Какие виды отношений могут быть в реляционной БД (несколько):",
      answers: ["объектные", "связные"],
    },
    {
      question:
        "Для того, чтобы получить доступ к объектам базы данных Jet надо установить активную ссылку на объект",
      answers: ["DBEngine"],
    },
    {
      question: "Что НЕ входит в ограничение целостности",
      answers: ["целостность атрибутов"],
    },
    {
      question: "Каких агрегатных функций не существует (несколько)",
      answers: ["FIRST", "NEXT", "LAST", "VAR", "MID"],
    },
    {
      question: "Выберите правильное определение БД (повтор)",
      answers: [
        "большой объем данных, структурированный по определенным правилам",
      ],
    },
    {
      question:
        "Совокупность реальных объектов реального мира, информация о которых должна храниться в базе данных (повтор)",
      answers: ["сущность"],
    },
    {
      question:
        "Правило целостности объектов содержит следующие ограничения: (повтор)",
      answers: [
        "кортеж базового отношения - реальная сущность реального мира",
        "элемент первичного ключа не допускает null-значение",
      ],
    },
    {
      question:
        "Что из перечисленного является определением модели данных (повтор)",
      answers: ["совокупность структур данных и операций их обработки"],
    },
    {
      question:
        "В каком году была утверждена стратегия развития информационного общества РФ?",
      answers: ["в 2017 г."],
    },
    {
      question:
        "Выберите основной признак, характеризующий Robots-as-a-Service, City-as-a-Service – модели",
      answers: ["основанные на использовании ресурсов, а не на владении ими"],
    },
    {
      question:
        "В чем особенность национального проекта «Цифровая экономика»? (повтор)",
      answers: ["все верно"],
    },
    {
      question: "Основными принципами «Индустрии 4.0» является:",
      answers: [
        "интеграция всех этапов жизненного цикла в единое информационное пространство и взаимодействие машин без участия человека.",
      ],
    },
    {
      question:
        "Технологии смарт-контракта относятся к следующим сквозным технологиям:",
      answers: ["Технология распределенного реестра", "Блокчейн"],
    },
    {
      question:
        "Выберите информационные технологии, предназначенные для создания, хранения и обработки данных",
      answers: [
        "хранилища данных",
        "технологии анализа больших данных",
        "технология распределенного реестра",
        "технологии искусственного интеллекта",
      ],
    },
    {
      question:
        "«Хозяйственная деятельность», в которой ключевым фактором производства являются данные в цифровом виде – это:",
      answers: ["цифровая экономика"],
    },
    {
      question:
        "Выберите, к какой из перечисленных технологий относится субтехнология «компьютерное зрение»",
      answers: ["искусственный интеллект"],
    },
    {
      question:
        "Человеко-машинное взаимодействие относится к следующим сквозным технологиям:",
      answers: ["Компоненты робототехники и сенсорных"],
    },
    {
      question:
        "Выберите основной признак, характеризующий Краудсорсинговые бизнес-модели (повтор)",
      answers: [
        "модели, базирующиеся на привлечении внешних ресурсов (денежных средств, людей, идей и др.) для реализации бизнес-процессов",
      ],
    },
    {
      question: "Когда состоялась 4 промышленная революция? (повтор)",
      answers: ["в 2011 г."],
    },
    {
      question: "Что НЕ относится к технологии ИИ?",
      answers: ["Нанотехнологии"],
    },
    {
      question:
        "Выберите основной признак, характеризующий Product-as-a-Service (PaaS) – модели",
      answers: ["основанные на использовании ресурсов, а не на владении ими"],
    },
    {
      question: "Что относится к сквозным технологиям? (повтор)",
      answers: ["Системы распределенного реестра", "Большие данные"],
    },
    {
      question:
        "Выберите основной признак, характеризующий Цифровые платформы (повтор)",
      answers: [
        "обеспечивающие прямое взаимодействие продавцов, покупателей и партнеров-поставщиков, минимизирующие транзакционные издержки и расширяющие возможности совместного потребления товаров и услуг",
      ],
    },
    {
      question: "Информационная технология включает в себя:",
      answers: [
        "процессы, методы поиска, сбора, хранения, обработки информации",
      ],
    },
    {
      question: "Найдите верное определение информационной технологии",
      answers: [
        "совокупность методов обработки, применения статистических и математических методов для принятия решений и моделирования мышления более высокого порядка с помощью компьютерных программ",
        "приёмы, способы и методы применения средств вычислительной техники при выполнении функций сбора, хранения, обработки, передачи и использования данных",
      ],
    },
    {
      question:
        "Какая компания предоставляет в ежегодных отчетах «Цикл хайпа»?",
      answers: ["Gartner"],
    },
    {
      question: "Какие технологии используют для сбора данных?",
      answers: ["IoT(интернет вещей)", "Big Data"],
    },
    {
      question: "Какие технологии используют для передачи и хранения данных?",
      answers: ["5G", "Квантовые технологии", "Облака", "Блокчейн"],
    },
    {
      question: "Почему студентам важно знать о практическом применении ИИ?",
      answers: [
        "ИИ - это сквозная технология, применяемая в различных отраслях экономики",
        "Прикладное применение ИИ – это активное развивающееся направление",
        "Умение решать инженерные задачи с применением ИИ",
      ],
    },
    {
      question: "Какие технологии помогают анализировать и принимать решения?",
      answers: ["Искусственный интеллект", "Нейротехнологии"],
    },
    {
      question: "Для чего применяется цикл Хайпа?",
      answers: ["для оценки зрелости информационной технологии"],
    },
    {
      question:
        "Выберите сквозные технологии, предназначенные для сбора, хранения и обработки данных",
      answers: [
        "технологии искусственного интеллекта",
        "технологии анализа больших данных",
        "IoT (интернет вещей)",
      ],
    },
  ],
};
